#### データファイルの読み込み

In [1]:
import pandas as pd

#### stock_price.csvの読み込み

In [2]:
df1 = pd.read_csv("data/stock_price.csv", sep=",")
display(df1.head())
print(df1.shape)
print(df1.info())

     Date  HITACHI  TOSHIBA  NEC  SONY  NISSAN  TOYOTA
0  200501      688      419  594  3840    1095    4030
1  200502      663      460  679  3990    1125    4070
2  200503      666      448  648  4270    1099    3990
3  200504      620      430  578  3920    1040    3840
4  200505      652      445  603  4060    1067    3860

(48, 7)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Date     48 non-null     int64
 1   HITACHI  48 non-null     int64
 2   TOSHIBA  48 non-null     int64
 3   NEC      48 non-null     int64
 4   SONY     48 non-null     int64
 5   NISSAN   48 non-null     int64
 6   TOYOTA   48 non-null     int64
dtypes: int64(7)
memory usage: 2.8 KB
None

#### s1-rdata.csvの読み込み

In [3]:
df2 = pd.read_csv("data/s1-rdata.csv", sep=",")
display(df2.head())
print(df2.shape)
print(df2.info())

    5   50
0   4   40
1   3   30
2  13  130
3   8   80
4   2   20

(5, 2)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0    5      5 non-null      int64
 1     50    5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes
None

#### gdp_1960_2016.txtの読み込み

In [4]:
df3 = pd.read_csv("data/gdp_1960_2016.txt", sep="\t",  skiprows=9, header=0)
display(df3.head())
print(df3.shape)
print(df3.info())

   Year     China GDP     Japan GDP       USA GDP
0  1960  5.971647e+10  4.409611e+10  543300000000
1  1961  5.005687e+10  5.321689e+10  563300000000
2  1962  4.720936e+10  6.036689e+10  605100000000
3  1963  5.070680e+10  6.906042e+10  638600000000
4  1964  5.970834e+10  8.116351e+10  685800000000

(57, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57 entries, 0 to 56
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Year       57 non-null     int64
 1   China GDP  57 non-null     float64
 2   Japan GDP  57 non-null     float64
 3   USA GDP    57 non-null     int64
dtypes: float64(2), int64(2)
memory usage: 1.9 KB
None